Autodesk.Revit.DB.ExternalService.ExternalServiceResult
Since:
2013
An enumerated value representing a result from executing an external service.
Since:
2013

Autodesk.Revit.DB.ExternalService.ExternalServiceResult.Unhandled
Execution of a service has not been handled; possibly because there are no applicable servers.

Autodesk.Revit.DB.ExternalService.ExternalServiceResult.Failed
Service execution has failed.

Autodesk.Revit.DB.ExternalService.ExternalServiceResult.Succeeded
Service has been executed successfully.